ajkajkbkc/ESX/board/pin_mux.c
void mux_leds(void)
{
#if 1
    /* For LEDs */
    // MCU_LED_RUN
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_AD_B0_15_GPIO1_IO15,        /* GPIO_EMC_39 is configured as GPIO3_IO25 */
        0U);                                    /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinConfig(
        IOMUXC_GPIO_AD_B0_15_GPIO1_IO15,        /* GPIO_EMC_39 PAD functional properties : */
        0x0008u);                               /* Slew Rate Field: Slow Slew Rate
                                                 Drive Strength Field: R0/6
                                                 Speed Field: medium(100MHz)
                                                 Open Drain Enable Field: Open Drain Disabled
                                                 Pull / Keep Enable Field: Pull/Keeper Enabled
                                                 Pull / Keep Select Field: Keeper
                                                 Pull Up / Down Config. Field: 100K Ohm Pull Down
                                                 Hyst. Enable Field: Hysteresis Disabled */
    // MCU_LED_ERR
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_AD_B0_14_GPIO1_IO14,        /* GPIO_AD_B0_04 is configured as GPIO1_IO04 */
        0U);                                    /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinConfig(
        IOMUXC_GPIO_AD_B0_14_GPIO1_IO14,        /* GPIO_AD_B0_04 PAD functional properties : */
        0x0008u);                               /* Slew Rate Field: Slow Slew Rate
                                                Drive Strength Field: R0/6
                                                Speed Field: medium(100MHz)
                                                Open Drain Enable Field: Open Drain Disabled
                                                Pull / Keep Enable Field: Pull/Keeper Enabled
                                                Pull / Keep Select Field: Keeper
                                                Pull Up / Down Config. Field: 100K Ohm Pull Down
                                                Hyst. Enable Field: Hysteresis Disabled */
//    // MCU_LED_NET1
//    IOMUXC_SetPinMux(
//        IOMUXC_GPIO_AD_B1_05_GPIO1_IO21,
//        0U);
//    IOMUXC_SetPinConfig(
//        IOMUXC_GPIO_AD_B1_05_GPIO1_IO21,
//        0x0008u);

//    // MCU_LED_NET2
//    IOMUXC_SetPinMux(
//        IOMUXC_GPIO_AD_B1_09_GPIO1_IO25,
//        0U);
//    IOMUXC_SetPinConfig(
//        IOMUXC_GPIO_AD_B1_09_GPIO1_IO25,
//        0x0008u);

    // MCU_LED_UNDEF
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_B1_12_GPIO2_IO28,
        0U);
    IOMUXC_SetPinConfig(
        IOMUXC_GPIO_B1_12_GPIO2_IO28,
        0x0008u);
#else
    /* For LEDs */
    // MCU_LED_RUN
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_AD_B1_12_GPIO1_IO28,        /* GPIO_EMC_39 is configured as GPIO3_IO25 */
        0U);                                    /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinConfig(
        IOMUXC_GPIO_AD_B1_12_GPIO1_IO28,        /* GPIO_EMC_39 PAD functional properties : */
        0x0008u);                               /* Slew Rate Field: Slow Slew Rate
                                                 Drive Strength Field: R0/6
                                                 Speed Field: medium(100MHz)
                                                 Open Drain Enable Field: Open Drain Disabled
                                                 Pull / Keep Enable Field: Pull/Keeper Enabled
                                                 Pull / Keep Select Field: Keeper
                                                 Pull Up / Down Config. Field: 100K Ohm Pull Down
                                                 Hyst. Enable Field: Hysteresis Disabled */
    // MCU_LED_ERR
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_AD_B1_04_GPIO1_IO20,        /* GPIO_AD_B0_04 is configured as GPIO1_IO04 */
        0U);                                    /* Software Input On Field: Input Path is determined by functionality */
    IOMUXC_SetPinConfig(
        IOMUXC_GPIO_AD_B1_04_GPIO1_IO20,        /* GPIO_AD_B0_04 PAD functional properties : */
        0x0008u);                               /* Slew Rate Field: Slow Slew Rate
                                                Drive Strength Field: R0/6
                                                Speed Field: medium(100MHz)
                                                Open Drain Enable Field: Open Drain Disabled
                                                Pull / Keep Enable Field: Pull/Keeper Enabled
                                                Pull / Keep Select Field: Keeper
                                                Pull Up / Down Config. Field: 100K Ohm Pull Down
                                                Hyst. Enable Field: Hysteresis Disabled */
    // MCU_LED_NET1
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_AD_B1_05_GPIO1_IO21,
        0U);
    IOMUXC_SetPinConfig(
        IOMUXC_GPIO_AD_B1_05_GPIO1_IO21,
        0x0008u);

    // MCU_LED_NET2
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_AD_B1_09_GPIO1_IO25,
        0U);
    IOMUXC_SetPinConfig(
        IOMUXC_GPIO_AD_B1_09_GPIO1_IO25,
        0x0008u);

    // MCU_LED_UNDEF
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_AD_B1_08_GPIO1_IO24,
        0U);
    IOMUXC_SetPinConfig(
        IOMUXC_GPIO_AD_B1_08_GPIO1_IO24,
        0x0008u);
#endif
}

void mux_flexspi_flash(void)
{
    /* For FlexSPI Nor Flash */
    // N3
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_SD_B1_05_FLEXSPIA_DQS,      /* GPIO_SD_B1_05 is configured as FLEXSPIA_DQS */
        1U);                                    /* Software Input On Field: Force input path of pad GPIO_SD_B1_05 */
    // L3
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_SD_B1_06_FLEXSPIA_SS0_B,    /* GPIO_SD_B1_06 is configured as FLEXSPIA_SS0_B */
        1U);                                    /* Software Input On Field: Force input path of pad GPIO_SD_B1_06 */
    // L4
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_SD_B1_07_FLEXSPIA_SCLK,     /* GPIO_SD_B1_07 is configured as FLEXSPIA_SCLK */
        1U);                                    /* Software Input On Field: Force input path of pad GPIO_SD_B1_07 */
    // P3
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_SD_B1_08_FLEXSPIA_DATA00,   /* GPIO_SD_B1_08 is configured as FLEXSPIA_DATA00 */
        1U);                                    /* Software Input On Field: Force input path of pad GPIO_SD_B1_08 */
    // N4
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_SD_B1_09_FLEXSPIA_DATA01,   /* GPIO_SD_B1_09 is configured as FLEXSPIA_DATA01 */
        1U);                                    /* Software Input On Field: Force input path of pad GPIO_SD_B1_09 */
    // P4
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_SD_B1_10_FLEXSPIA_DATA02,   /* GPIO_SD_B1_10 is configured as FLEXSPIA_DATA02 */
        1U);                                    /* Software Input On Field: Force input path of pad GPIO_SD_B1_10 */
    // P5
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_SD_B1_11_FLEXSPIA_DATA03,   /* GPIO_SD_B1_11 is configured as FLEXSPIA_DATA03 */
        1U);
    IOMUXC_SetPinConfig(
        IOMUXC_GPIO_SD_B1_05_FLEXSPIA_DQS,      /* GPIO_SD_B1_05 PAD functional properties : */
        0x10F1u);                               /* Slew Rate Field: Fast Slew Rate
                                                 Drive Strength Field: R0/6
                                                 Speed Field: max(200MHz)
                                                 Open Drain Enable Field: Open Drain Disabled
                                                 Pull / Keep Enable Field: Pull/Keeper Enabled
                                                 Pull / Keep Select Field: Keeper
                                                 Pull Up / Down Config. Field: 100K Ohm Pull Down
                                                 Hyst. Enable Field: Hysteresis Disabled */
    IOMUXC_SetPinConfig(
        IOMUXC_GPIO_SD_B1_06_FLEXSPIA_SS0_B,    /* GPIO_SD_B1_06 PAD functional properties : */
        0x10F1u);                               /* Slew Rate Field: Fast Slew Rate
                                                 Drive Strength Field: R0/6
                                                 Speed Field: max(200MHz)
                                                 Open Drain Enable Field: Open Drain Disabled
                                                 Pull / Keep Enable Field: Pull/Keeper Enabled
                                                 Pull / Keep Select Field: Keeper
                                                 Pull Up / Down Config. Field: 100K Ohm Pull Down
                                                 Hyst. Enable Field: Hysteresis Disabled */
    IOMUXC_SetPinConfig(
        IOMUXC_GPIO_SD_B1_07_FLEXSPIA_SCLK,     /* GPIO_SD_B1_07 PAD functional properties : */
        0x10F1u);                               /* Slew Rate Field: Fast Slew Rate
                                                 Drive Strength Field: R0/6
                                                 Speed Field: max(200MHz)
                                                 Open Drain Enable Field: Open Drain Disabled
                                                 Pull / Keep Enable Field: Pull/Keeper Enabled
                                                 Pull / Keep Select Field: Keeper
                                                 Pull Up / Down Config. Field: 100K Ohm Pull Down
                                                 Hyst. Enable Field: Hysteresis Disabled */
    IOMUXC_SetPinConfig(
        IOMUXC_GPIO_SD_B1_08_FLEXSPIA_DATA00,   /* GPIO_SD_B1_08 PAD functional properties : */
        0x10F1u);                               /* Slew Rate Field: Fast Slew Rate
                                                 Drive Strength Field: R0/6
                                                 Speed Field: max(200MHz)
                                                 Open Drain Enable Field: Open Drain Disabled
                                                 Pull / Keep Enable Field: Pull/Keeper Enabled
                                                 Pull / Keep Select Field: Keeper
                                                 Pull Up / Down Config. Field: 100K Ohm Pull Down
                                                 Hyst. Enable Field: Hysteresis Disabled */
    IOMUXC_SetPinConfig(
        IOMUXC_GPIO_SD_B1_09_FLEXSPIA_DATA01,   /* GPIO_SD_B1_09 PAD functional properties : */
        0x10F1u);                               /* Slew Rate Field: Fast Slew Rate
                                                 Drive Strength Field: R0/6
                                                 Speed Field: max(200MHz)
                                                 Open Drain Enable Field: Open Drain Disabled
                                                 Pull / Keep Enable Field: Pull/Keeper Enabled
                                                 Pull / Keep Select Field: Keeper
                                                 Pull Up / Down Config. Field: 100K Ohm Pull Down
                                                 Hyst. Enable Field: Hysteresis Disabled */
    IOMUXC_SetPinConfig(
        IOMUXC_GPIO_SD_B1_10_FLEXSPIA_DATA02,   /* GPIO_SD_B1_10 PAD functional properties : */
        0x10F1u);                               /* Slew Rate Field: Fast Slew Rate
                                                 Drive Strength Field: R0/6
                                                 Speed Field: max(200MHz)
                                                 Open Drain Enable Field: Open Drain Disabled
                                                 Pull / Keep Enable Field: Pull/Keeper Enabled
                                                 Pull / Keep Select Field: Keeper
                                                 Pull Up / Down Config. Field: 100K Ohm Pull Down
                                                 Hyst. Enable Field: Hysteresis Disabled */
    IOMUXC_SetPinConfig(
        IOMUXC_GPIO_SD_B1_11_FLEXSPIA_DATA03,   /* GPIO_SD_B1_11 PAD functional properties : */
        0x10F1u);                               /* Slew Rate Field: Fast Slew Rate
                                                 Drive Strength Field: R0/6
                                                 Speed Field: max(200MHz)
                                                 Open Drain Enable Field: Open Drain Disabled
                                                 Pull / Keep Enable Field: Pull/Keeper Enabled
                                                 Pull / Keep Select Field: Keeper
                                                 Pull Up / Down Config. Field: 100K Ohm Pull Down
                                                 Hyst. Enable Field: Hysteresis Disabled */
}

// For DS1302 use
static void mux_i2c(void)
{
#if 0
    // SCL
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_SD_B0_00_GPIO3_IO12,
        0U);
    // SDA(IO)
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_SD_B0_01_GPIO3_IO13,
        0U);
    // CE
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_SD_B1_04_GPIO3_IO04,
        0U);

    IOMUXC_SetPinConfig(
        IOMUXC_GPIO_SD_B0_00_GPIO3_IO12,
        0x1008u);
    IOMUXC_SetPinConfig(
        IOMUXC_GPIO_SD_B0_01_GPIO3_IO13,
        0x1008u);
    IOMUXC_SetPinConfig(
        IOMUXC_GPIO_SD_B1_04_GPIO3_IO04,
        0x1008u);
#else
  IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_00_LPI2C1_SCL, 1U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_01_LPI2C1_SDA, 1U); 

