ajkajkbkc/ESX/board/pin_mux.c
#define Y_CONFIG_VALUE  0x1008u
static void mux_y0_y7(void)
{
    #if 1
    // MCU_Y0
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_SD_B0_02_GPIO3_IO14,
        0U);
    // MCU_Y1
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_SD_B0_03_GPIO3_IO15,
        0U);
    #else
    IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B0_02_FLEXPWM1_PWMA01, 0U);
    IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B0_02_FLEXPWM1_PWMA01, 0x10b0u);
    IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B0_03_FLEXPWM1_PWMB01, 0U);
    IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B0_03_FLEXPWM1_PWMB01, 0x10b0u);
    #endif
    // MCU_Y2
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_SD_B0_04_GPIO3_IO16,
        0U);
    // MCU_Y3
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_SD_B0_05_GPIO3_IO17,
        0U);
    // MCU_Y4
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_AD_B0_10_GPIO1_IO10,
        0U);
    // MCU_Y5
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_AD_B0_11_GPIO1_IO11,
        0U);
    // MCU_Y6
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_AD_B0_09_GPIO1_IO09,
        0U);
    // MCU_Y7
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_SD_B1_02_GPIO3_IO02,
        0U);
#if 1
    IOMUXC_SetPinConfig(
        IOMUXC_GPIO_SD_B0_02_GPIO3_IO14,
        Y_CONFIG_VALUE);
    IOMUXC_SetPinConfig(
        IOMUXC_GPIO_SD_B0_03_GPIO3_IO15,
        Y_CONFIG_VALUE);
#endif
    IOMUXC_SetPinConfig(
        IOMUXC_GPIO_SD_B0_04_GPIO3_IO16,
        Y_CONFIG_VALUE);
    IOMUXC_SetPinConfig(
        IOMUXC_GPIO_SD_B0_05_GPIO3_IO17,
        Y_CONFIG_VALUE);
    IOMUXC_SetPinConfig(
        IOMUXC_GPIO_AD_B0_10_GPIO1_IO10,
        Y_CONFIG_VALUE);
    IOMUXC_SetPinConfig(
        IOMUXC_GPIO_AD_B0_11_GPIO1_IO11,
        Y_CONFIG_VALUE);
    IOMUXC_SetPinConfig(
        IOMUXC_GPIO_AD_B0_09_GPIO1_IO09,
        Y_CONFIG_VALUE);
    IOMUXC_SetPinConfig(
        IOMUXC_GPIO_SD_B1_02_GPIO3_IO02,
        Y_CONFIG_VALUE);
}

//#define IOMUXC_PIN_CONFIG_VALUE     (0x10C9u)
#define IOMUXC_PIN_CONFIG_VALUE_DM     (0x10B0u)
static void mux_dm(void)
{
    //J14, SRCLK & CLK
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_AD_B1_15_GPIO1_IO31,        /* GPIO_SD_B0_00 is configured as LPSPI1_SCK */
        0U);                                    /* Software Input On Field: Input Path is determined by functionality */
    //G11, !LD
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_AD_B0_03_GPIO1_IO03,
        0U);
    //G12, QH, INPUT
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_AD_B1_14_GPIO1_IO30,
        0U);
    //H11, SER
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_AD_B1_13_GPIO1_IO29,
        0U);
    // L13, !SRCLR
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_AD_B1_10_GPIO1_IO26,
        0U);
    // H12, RCLK
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_AD_B1_12_GPIO1_IO28,
        0U);
    // L12, !OE
    IOMUXC_SetPinMux(
        IOMUXC_GPIO_AD_B1_04_GPIO1_IO20,
        0U);
    
    IOMUXC_SetPinConfig(
      IOMUXC_GPIO_AD_B1_15_GPIO1_IO31,
      IOMUXC_PIN_CONFIG_VALUE_DM);
    IOMUXC_SetPinConfig(
      IOMUXC_GPIO_AD_B0_03_GPIO1_IO03,       /* GPIO_SD_B0_01 PAD functional properties : */
      IOMUXC_PIN_CONFIG_VALUE_DM);                               /* Slew Rate Field: Slow Slew Rate
                                                 Drive Strength Field: R0/6
                                                 Speed Field: medium(100MHz)
                                                 Open Drain Enable Field: Open Drain Disabled
                                                 Pull / Keep Enable Field: Pull/Keeper Enabled
                                                 Pull / Keep Select Field: Keeper
                                                 Pull Up / Down Config. Field: 100K Ohm Pull Down
                                                 Hyst. Enable Field: Hysteresis Disabled */
    IOMUXC_SetPinConfig(
      IOMUXC_GPIO_AD_B1_14_GPIO1_IO30,        /* GPIO_SD_B0_02 PAD functional properties : */
      IOMUXC_PIN_CONFIG_VALUE_DM);                               /* Slew Rate Field: Slow Slew Rate
                                                 Drive Strength Field: R0/6
                                                 Speed Field: medium(100MHz)
                                                 Open Drain Enable Field: Open Drain Disabled
                                                 Pull / Keep Enable Field: Pull/Keeper Enabled
                                                 Pull / Keep Select Field: Keeper
                                                 Pull Up / Down Config. Field: 100K Ohm Pull Down
                                                 Hyst. Enable Field: Hysteresis Disabled */
    IOMUXC_SetPinConfig(
      IOMUXC_GPIO_AD_B1_13_GPIO1_IO29,        /* GPIO_SD_B0_03 PAD functional properties : */
      IOMUXC_PIN_CONFIG_VALUE_DM);                               /* Slew Rate Field: Slow Slew Rate
                                                 Drive Strength Field: R0/6
                                                 Speed Field: medium(100MHz)
                                                 Open Drain Enable Field: Open Drain Disabled
                                                 Pull / Keep Enable Field: Pull/Keeper Enabled
                                                 Pull / Keep Select Field: Keeper
                                                 Pull Up / Down Config. Field: 100K Ohm Pull Down
                                                 Hyst. Enable Field: Hysteresis Disabled */

     IOMUXC_SetPinConfig(
          IOMUXC_GPIO_AD_B1_10_GPIO1_IO26,        /* GPIO_AD_B1_10 PAD functional properties : */
          IOMUXC_PIN_CONFIG_VALUE_DM);                               /* Slew Rate Field: Slow Slew Rate
                                                   Drive Strength Field: R0/6
                                                   Speed Field: medium(100MHz)
                                                   Open Drain Enable Field: Open Drain Disabled
                                                   Pull / Keep Enable Field: Pull/Keeper Enabled
                                                   Pull / Keep Select Field: Keeper
                                                   Pull Up / Down Config. Field: 100K Ohm Pull Down
                                                   Hyst. Enable Field: Hysteresis Disabled */
     IOMUXC_SetPinConfig(
             IOMUXC_GPIO_AD_B1_12_GPIO1_IO28,
             IOMUXC_PIN_CONFIG_VALUE_DM);
     IOMUXC_SetPinConfig(
             IOMUXC_GPIO_AD_B1_04_GPIO1_IO20,
             IOMUXC_PIN_CONFIG_VALUE_DM);
}

void BOARD_InitPins(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc);           /* iomuxc clock (iomuxc_clk_enable): 0x03U */

  //uint16_t deviceID = bsp_get_deviceID();
  //mux_lpuart1();
  //mux_lpuart2();
  mux_lpuart3();
  mux_lpuart4();
  mux_lpuart8();
  mux_flexspi_flash();
  //mux_enet1();
  //mux_enet2();
  mux_leds();
#if 0
  mux_sd_card();
  if (deviceID == FX_08R06AI08_C1 || deviceID == FX_08R06AI08_C2)
  {
    mux_spi3();
  }
  if (!(deviceID == FW_C1 || deviceID == FW28E_C1 || deviceID == FW_C2))
  {
    mux_x0_x7();
    mux_y0_y5();
  }
#endif
  //mux_x0_x7();
  //mux_y0_y7();
  //mux_low_power_detect();
  mux_i2c();
#if 0
  if (deviceID == FX_16R14_C1 || deviceID == FX_16R14_C2)
  {
    mux_dm();
  }
#endif
}

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
